vim.fn['skkeleton#register_kanatable']('rom', {
    ['sha'] = false,
    ['shi'] = false,
    ['shu'] = false,
    ['she'] = false,
    ['sho'] = false,
    ['tha'] = false,
    ['thi'] = false,
    ['thu'] = false,
    ['the'] = false,
    ['tho'] = false,
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['kt'] = {'こと', ''},
    ['ds'] = {'です', ''},
    ['ms'] = {'ます', ''},
    ['sm'] = {'さま', ''},
    ['sr'] = {'する', ''},
    ['st'] = {'した', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['l'] = false,
    ['la'] = {'ぁ', ''},
    ['li'] = {'ぃ', ''},
    ['lu'] = {'ぅ', ''},
    ['le'] = {'ぇ', ''},
    ['lo'] = {'ぉ', ''},
    ['ltu'] = {'っ', ''},
    ['lya'] = {'ゃ', ''},
    ['lyu'] = {'ゅ', ''},
    ['lyo'] = {'ょ', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['kz'] = {'かん', ''},
    ['kk'] = {'きん', ''},
    ['kj'] = {'くん', ''},
    ['kd'] = {'けん', ''},
    ['kl'] = {'こん', ''},
    ['kq'] = {'かい', ''},
    ['kh'] = {'くう', ''},
    ['kw'] = {'けい', ''},
    ['kp'] = {'こう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['sz'] = {'さん', ''},
    ['sk'] = {'しん', ''},
    ['sj'] = {'すん', ''},
    ['sd'] = {'せん', ''},
    ['sl'] = {'そん', ''},
    ['sq'] = {'さい', ''},
    ['sh'] = {'すう', ''},
    ['sw'] = {'せい', ''},
    ['sp'] = {'そう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['tz'] = {'たん', ''},
    ['tk'] = {'ちん', ''},
    ['tj'] = {'つん', ''},
    ['td'] = {'てん', ''},
    ['tgi'] = {'てぃ', ''},
    ['tl'] = {'とん', ''},
    ['tq'] = {'たい', ''},
    ['th'] = {'つう', ''},
    ['tw'] = {'てい', ''},
    ['tgi'] = {'てぃ', ''},
    ['tp'] = {'とう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['nz'] = {'なん', ''},
    ['nk'] = {'にん', ''},
    ['nj'] = {'ぬん', ''},
    ['nd'] = {'ねん', ''},
    ['nl'] = {'のん', ''},
    ['nq'] = {'ない', ''},
    ['nh'] = {'ぬう', ''},
    ['nw'] = {'ねい', ''},
    ['np'] = {'のう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['hz'] = {'はん', ''},
    ['hk'] = {'ひん', ''},
    ['hd'] = {'へん', ''},
    ['hl'] = {'ほん', ''},
    ['hq'] = {'はい', ''},
    ['hw'] = {'へい', ''},
    ['hp'] = {'ほう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['fz'] = {'ふぁん', ''},
    ['fk'] = {'ふぃん', ''},
    ['fj'] = {'ふん', ''},
    ['fd'] = {'ふぇん', ''},
    ['fl'] = {'ふぉん', ''},
    ['fq'] = {'ふぁい', ''},
    ['fh'] = {'ふう', ''},
    ['fw'] = {'ふぇい', ''},
    ['fp'] = {'ふぉう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['mz'] = {'まん', ''},
    ['mk'] = {'みん', ''},
    ['mj'] = {'むん', ''},
    ['md'] = {'めん', ''},
    ['ml'] = {'もん', ''},
    ['mq'] = {'まい', ''},
    ['mh'] = {'むう', ''},
    ['mw'] = {'めい', ''},
    ['mp'] = {'もう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['yz'] = {'やん', ''},
    ['yj'] = {'ゆん', ''},
    ['yl'] = {'よん', ''},
    ['yq'] = {'やい', ''},
    ['yh'] = {'ゆう', ''},
    ['yp'] = {'よう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['rz'] = {'らん', ''},
    ['rk'] = {'りん', ''},
    ['rj'] = {'るん', ''},
    ['rd'] = {'れん', ''},
    ['rl'] = {'ろん', ''},
    ['rq'] = {'らい', ''},
    ['rh'] = {'るう', ''},
    ['rw'] = {'れい', ''},
    ['rp'] = {'ろう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['wz'] = {'わん', ''},
    ['wk'] = {'うぃん', ''},
    ['wd'] = {'うぇん', ''},
    ['wl'] = {'うぉん', ''},
    ['wq'] = {'わい', ''},
    ['ww'] = {'うぇい', ''},
    ['wp'] = {'うぉう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['gz'] = {'がん', ''},
    ['gk'] = {'ぎん', ''},
    ['gj'] = {'ぐん', ''},
    ['gd'] = {'げん', ''},
    ['gl'] = {'ごん', ''},
    ['gq'] = {'がい', ''},
    ['gh'] = {'ぐう', ''},
    ['gw'] = {'げい', ''},
    ['gp'] = {'ごう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['zz'] = {'ざん', ''},
    ['zd'] = {'ぜん', ''},
    ['zq'] = {'ざい', ''},
    ['zw'] = {'ぜい', ''},
    ['zp'] = {'ぞう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['dz'] = {'だん', ''},
    ['dk'] = {'ぢん', ''},
    ['dj'] = {'づん', ''},
    ['dd'] = {'でん', ''},
    ['dl'] = {'どん', ''},
    ['dq'] = {'だい', ''},
    ['dh'] = {'づう', ''},
    ['dw'] = {'でい', ''},
    ['dp'] = {'どう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['bz'] = {'ばん', ''},
    ['bk'] = {'びん', ''},
    ['bj'] = {'ぶん', ''},
    ['bd'] = {'べん', ''},
    ['bl'] = {'ぼん', ''},
    ['bq'] = {'ばい', ''},
    ['bh'] = {'ぶう', ''},
    ['bw'] = {'べい', ''},
    ['bp'] = {'ぼう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['pz'] = {'ぱん', ''},
    ['pk'] = {'ぴん', ''},
    ['pj'] = {'ぷん', ''},
    ['pd'] = {'ぺん', ''},
    ['pl'] = {'ぽん', ''},
    ['pq'] = {'ぱい', ''},
    ['ph'] = {'ぷう', ''},
    ['pw'] = {'ぺい', ''},
    ['pp'] = {'ぽう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['kyz'] = {'きゃん', ''},
    ['kyk'] = {'きぃん', ''},
    ['kyj'] = {'きゅん', ''},
    ['kyd'] = {'きぇん', ''},
    ['kyl'] = {'きょん', ''},
    ['kyq'] = {'きゃい', ''},
    ['kyh'] = {'きゅう', ''},
    ['kyw'] = {'きぇい', ''},
    ['kyp'] = {'きょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['syz'] = {'しゃん', ''},
    ['syk'] = {'しぃん', ''},
    ['syj'] = {'しゅん', ''},
    ['syd'] = {'しぇん', ''},
    ['syl'] = {'しょん', ''},
    ['syq'] = {'しゃい', ''},
    ['syh'] = {'しゅう', ''},
    ['syw'] = {'しぇい', ''},
    ['syp'] = {'しょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['xa'] = {'しゃ', ''},
    ['xi'] = {'しぃ', ''},
    ['xu'] = {'しゅ', ''},
    ['xe'] = {'しぇ', ''},
    ['xo'] = {'しょ', ''},
    ['xz'] = {'しゃん', ''},
    ['xk'] = {'しぃん', ''},
    ['xj'] = {'しゅん', ''},
    ['xd'] = {'しぇん', ''},
    ['xl'] = {'しょん', ''},
    ['xq'] = {'しゃい', ''},
    ['xh'] = {'しゅう', ''},
    ['xw'] = {'しぇい', ''},
    ['xp'] = {'しょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['tyz'] = {'ちゃん', ''},
    ['tyk'] = {'ちぃん', ''},
    ['tyj'] = {'ちゅん', ''},
    ['tyd'] = {'ちぇん', ''},
    ['tyl'] = {'ちょん', ''},
    ['tyq'] = {'ちゃい', ''},
    ['tyh'] = {'ちゅう', ''},
    ['tyw'] = {'ちぇい', ''},
    ['typ'] = {'ちょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['ca'] = {'ちゃ', ''},
    ['ci'] = {'ちぃ', ''},
    ['cu'] = {'ちゅ', ''},
    ['ce'] = {'ちぇ', ''},
    ['co'] = {'ちょ', ''},
    ['cz'] = {'ちゃん', ''},
    ['ck'] = {'ちぃん', ''},
    ['cj'] = {'ちゅん', ''},
    ['cd'] = {'ちぇん', ''},
    ['cl'] = {'ちょん', ''},
    ['cq'] = {'ちゃい', ''},
    ['ch'] = {'ちゅう', ''},
    ['cw'] = {'ちぇい', ''},
    ['cp'] = {'ちょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['nyz'] = {'にゃん', ''},
    ['nyk'] = {'にぃん', ''},
    ['nyj'] = {'にゅん', ''},
    ['nyd'] = {'にぇん', ''},
    ['nyl'] = {'にょん', ''},
    ['nyq'] = {'にゃい', ''},
    ['nyh'] = {'にゅう', ''},
    ['nyw'] = {'にぇい', ''},
    ['nyp'] = {'にょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['hyz'] = {'ひゃん', ''},
    ['hyk'] = {'ひぃん', ''},
    ['hyj'] = {'ひゅん', ''},
    ['hyd'] = {'ひぇん', ''},
    ['hyl'] = {'ひょん', ''},
    ['hyq'] = {'ひゃい', ''},
    ['hyh'] = {'ひゅう', ''},
    ['hyw'] = {'ひぇい', ''},
    ['hyp'] = {'ひょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['myz'] = {'みゃん', ''},
    ['myk'] = {'みぃん', ''},
    ['myj'] = {'みゅん', ''},
    ['myd'] = {'みぇん', ''},
    ['myl'] = {'みょん', ''},
    ['myq'] = {'みゃい', ''},
    ['myh'] = {'みゅう', ''},
    ['myw'] = {'みぇい', ''},
    ['myp'] = {'みょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['ryz'] = {'りゃん', ''},
    ['ryk'] = {'りぃん', ''},
    ['ryj'] = {'りゅん', ''},
    ['ryd'] = {'りぇん', ''},
    ['ryl'] = {'りょん', ''},
    ['ryq'] = {'りゃい', ''},
    ['ryh'] = {'りゅう', ''},
    ['ryw'] = {'りぇい', ''},
    ['ryp'] = {'りょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['gyz'] = {'ぎゃん', ''},
    ['gyk'] = {'ぎぃん', ''},
    ['gyj'] = {'ぎゅん', ''},
    ['gyd'] = {'ぎぇん', ''},
    ['gyl'] = {'ぎょん', ''},
    ['gyq'] = {'ぎゃい', ''},
    ['gyh'] = {'ぎゅう', ''},
    ['gyw'] = {'ぎぇい', ''},
    ['gyp'] = {'ぎょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['jz'] = {'じゃん', ''},
    ['jk'] = {'じん', ''},
    ['jj'] = {'じゅん', ''},
    ['jd'] = {'じぇん', ''},
    ['jl'] = {'じょん', ''},
    ['jq'] = {'じゃい', ''},
    ['jh'] = {'じゅう', ''},
    ['jw'] = {'じぇい', ''},
    ['jp'] = {'じょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['byz'] = {'びゃん', ''},
    ['byk'] = {'びぃん', ''},
    ['byj'] = {'びゅん', ''},
    ['byd'] = {'びぇん', ''},
    ['byl'] = {'びょん', ''},
    ['byq'] = {'びゃい', ''},
    ['byh'] = {'びゅう', ''},
    ['byw'] = {'びぇい', ''},
    ['byp'] = {'びょう', ''},
})

vim.fn['skkeleton#register_kanatable']('rom', {
    ['pyz'] = {'ぴゃん', ''},
    ['pyk'] = {'ぴぃん', ''},
    ['pyj'] = {'ぴゅん', ''},
    ['pyd'] = {'ぴぇん', ''},
    ['pyl'] = {'ぴょん', ''},
    ['pyq'] = {'ぴゃい', ''},
    ['pyh'] = {'ぴゅう', ''},
    ['pyw'] = {'ぴぇい', ''},
    ['pyp'] = {'ぴょう', ''},
})

